# Используем официальный образ Node.js (версия 14 или выше, чтобы соответствовать package.json)
FROM node:18

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем package.json и yarn.lock (если он есть) для установки зависимостей
COPY package.json ./
# Если у вас есть yarn.lock, раскомментируйте следующую строку
# COPY yarn.lock ./

# Устанавливаем Yarn и зависимости
RUN npm install -g yarn
RUN yarn install

# Копируем остальные файлы проекта
COPY . .

# Указываем порт, который будет использовать приложение
EXPOSE 3000

# Команда для запуска приложения
CMD ["yarn", "start"]
